Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS8B.xml
        <register name="SR" offset="0x18" rw="R" size="4" initval="0x00000002" caption="Status Register">
          <bitfield name="RXRDY" caption="RX Buffer Ready" mask="0x1"/>
          <bitfield name="TXRDY" caption="TX Buffer Ready" mask="0x2"/>
          <bitfield name="SEN" caption="Slave Enabled" mask="0x4"/>
          <bitfield name="TCOMP" caption="Transmission Complete" mask="0x8"/>
          <bitfield name="TRA" caption="Transmitter Mode" mask="0x20"/>
          <bitfield name="URUN" caption="Underrun" mask="0x40"/>
          <bitfield name="ORUN" caption="Overrun" mask="0x80"/>
          <bitfield name="NAK" caption="NAK Received" mask="0x100"/>
          <bitfield name="SMBTOUT" caption="SMBus Timeout" mask="0x1000"/>
          <bitfield name="SMBPECERR" caption="SMBus PEC Error" mask="0x2000"/>
          <bitfield name="BUSERR" caption="Bus Error" mask="0x4000"/>
          <bitfield name="SAM" caption="Slave Address Match" mask="0x10000"/>
          <bitfield name="GCM" caption="General Call Match" mask="0x20000"/>
          <bitfield name="SMBALERTM" caption="SMBus Alert Response Address Match" mask="0x40000"/>
          <bitfield name="SMBHHM" caption="SMBus Host Header Address Match" mask="0x80000"/>
          <bitfield name="SMBDAM" caption="SMBus Default Address Match" mask="0x100000"/>
          <bitfield name="STO" caption="Stop Received" mask="0x200000"/>
          <bitfield name="REP" caption="Repeated Start Received" mask="0x400000"/>
          <bitfield name="BTF" caption="Byte Transfer Finished" mask="0x800000"/>
        </register>
        <register name="IER" offset="0x1c" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="RXRDY" caption="RX Buffer Ready" mask="0x1"/>
          <bitfield name="TXRDY" caption="TX Buffer Ready" mask="0x2"/>
          <bitfield name="TCOMP" caption="Transmission Complete" mask="0x8"/>
          <bitfield name="URUN" caption="Underrun" mask="0x40"/>
          <bitfield name="ORUN" caption="Overrun" mask="0x80"/>
          <bitfield name="NAK" caption="NAK Received" mask="0x100"/>
          <bitfield name="SMBTOUT" caption="SMBus Timeout" mask="0x1000"/>
          <bitfield name="SMBPECERR" caption="SMBus PEC Error" mask="0x2000"/>
          <bitfield name="BUSERR" caption="Bus Error" mask="0x4000"/>
          <bitfield name="SAM" caption="Slave Address Match" mask="0x10000"/>
          <bitfield name="GCM" caption="General Call Match" mask="0x20000"/>
          <bitfield name="SMBALERTM" caption="SMBus Alert Response Address Match" mask="0x40000"/>
          <bitfield name="SMBHHM" caption="SMBus Host Header Address Match" mask="0x80000"/>
          <bitfield name="SMBDAM" caption="SMBus Default Address Match" mask="0x100000"/>
          <bitfield name="STO" caption="Stop Received" mask="0x200000"/>
          <bitfield name="REP" caption="Repeated Start Received" mask="0x400000"/>
          <bitfield name="BTF" caption="Byte Transfer Finished" mask="0x800000"/>
        </register>
        <register name="IDR" offset="0x20" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="RXRDY" caption="RX Buffer Ready" mask="0x1"/>
          <bitfield name="TXRDY" caption="TX Buffer Ready" mask="0x2"/>
          <bitfield name="TCOMP" caption="Transmission Complete" mask="0x8"/>
          <bitfield name="URUN" caption="Underrun" mask="0x40"/>
          <bitfield name="ORUN" caption="Overrun" mask="0x80"/>
          <bitfield name="NAK" caption="NAK Received" mask="0x100"/>
          <bitfield name="SMBTOUT" caption="SMBus Timeout" mask="0x1000"/>
          <bitfield name="SMBPECERR" caption="SMBus PEC Error" mask="0x2000"/>
          <bitfield name="BUSERR" caption="Bus Error" mask="0x4000"/>
          <bitfield name="SAM" caption="Slave Address Match" mask="0x10000"/>
          <bitfield name="GCM" caption="General Call Match" mask="0x20000"/>
          <bitfield name="SMBALERTM" caption="SMBus Alert Response Address Match" mask="0x40000"/>
          <bitfield name="SMBHHM" caption="SMBus Host Header Address Match" mask="0x80000"/>
          <bitfield name="SMBDAM" caption="SMBus Default Address Match" mask="0x100000"/>
          <bitfield name="STO" caption="Stop Received" mask="0x200000"/>
          <bitfield name="REP" caption="Repeated Start Received" mask="0x400000"/>
          <bitfield name="BTF" caption="Byte Transfer Finished" mask="0x800000"/>
        </register>
        <register name="IMR" offset="0x24" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="RXRDY" caption="RX Buffer Ready" mask="0x1"/>
          <bitfield name="TXRDY" caption="TX Buffer Ready" mask="0x2"/>
          <bitfield name="TCOMP" caption="Transmission Complete" mask="0x8"/>
          <bitfield name="URUN" caption="Underrun" mask="0x40"/>
          <bitfield name="ORUN" caption="Overrun" mask="0x80"/>
          <bitfield name="NAK" caption="NAK Received" mask="0x100"/>
          <bitfield name="SMBTOUT" caption="SMBus Timeout" mask="0x1000"/>
          <bitfield name="SMBPECERR" caption="SMBus PEC Error" mask="0x2000"/>
          <bitfield name="BUSERR" caption="Bus Error" mask="0x4000"/>
          <bitfield name="SAM" caption="Slave Address Match" mask="0x10000"/>
          <bitfield name="GCM" caption="General Call Match" mask="0x20000"/>
          <bitfield name="SMBALERTM" caption="SMBus Alert Response Address Match" mask="0x40000"/>
          <bitfield name="SMBHHM" caption="SMBus Host Header Address Match" mask="0x80000"/>
          <bitfield name="SMBDAM" caption="SMBus Default Address Match" mask="0x100000"/>
          <bitfield name="STO" caption="Stop Received" mask="0x200000"/>
          <bitfield name="REP" caption="Repeated Start Received" mask="0x400000"/>
          <bitfield name="BTF" caption="Byte Transfer Finished" mask="0x800000"/>
        </register>
        <register name="SCR" offset="0x28" rw="W" size="4" initval="0x00000000" caption="Status Clear Register">
          <bitfield name="TCOMP" caption="Transmission Complete" mask="0x8"/>
          <bitfield name="URUN" caption="Underrun" mask="0x40"/>
          <bitfield name="ORUN" caption="Overrun" mask="0x80"/>
          <bitfield name="NAK" caption="NAK Received" mask="0x100"/>
          <bitfield name="SMBTOUT" caption="SMBus Timeout" mask="0x1000"/>
          <bitfield name="SMBPECERR" caption="SMBus PEC Error" mask="0x2000"/>
          <bitfield name="BUSERR" caption="Bus Error" mask="0x4000"/>
          <bitfield name="SAM" caption="Slave Address Match" mask="0x10000"/>
          <bitfield name="GCM" caption="General Call Match" mask="0x20000"/>
          <bitfield name="SMBALERTM" caption="SMBus Alert Response Address Match" mask="0x40000"/>
          <bitfield name="SMBHHM" caption="SMBus Host Header Address Match" mask="0x80000"/>
          <bitfield name="SMBDAM" caption="SMBus Default Address Match" mask="0x100000"/>
          <bitfield name="STO" caption="Stop Received" mask="0x200000"/>
          <bitfield name="REP" caption="Repeated Start Received" mask="0x400000"/>
          <bitfield name="BTF" caption="Byte Transfer Finished" mask="0x800000"/>
        </register>
