Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS8B.xml
        <register name="IDR" offset="0xc" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <mode name="LIN_MODE">
            <bitfield name="RXRDY" caption="Receiver Ready Interrupt Disable" mask="0x1" values="USART_IDR__RXRDY"/>
            <bitfield name="TXRDY" caption="Transmitter Ready Interrupt Disable" mask="0x2" values="USART_IDR__TXRDY"/>
            <bitfield name="RXBRK" caption="Receiver Break Interrupt Disable" mask="0x4" values="USART_IDR__RXBRK"/>
            <bitfield name="OVRE" caption="Overrun Error Interrupt Disable" mask="0x20" values="USART_IDR__OVRE"/>
            <bitfield name="FRAME" caption="Framing Error Interrupt Disable" mask="0x40" values="USART_IDR__FRAME"/>
            <bitfield name="PARE" caption="Parity Error Interrupt Disable" mask="0x80" values="USART_IDR__PARE"/>
            <bitfield name="TIMEOUT" caption="Time-out Interrupt Disable" mask="0x100" values="USART_IDR__TIMEOUT"/>
            <bitfield name="TXEMPTY" caption="Transmitter Empty Interrupt Disable" mask="0x200" values="USART_IDR__TXEMPTY"/>
            <bitfield name="ITER" caption="Iteration Interrupt Disable" mask="0x400" values="USART_IDR__ITER"/>
            <bitfield name="TXBUFE" caption="Buffer Empty Interrupt Disable" mask="0x800" values="USART_IDR__TXBUFE"/>
            <bitfield name="RXBUFF" caption="Buffer Full Interrupt Disable" mask="0x1000" values="USART_IDR__RXBUFF"/>
            <bitfield name="NACK" caption="Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Disable" mask="0x2000" values="USART_IDR__NACK"/>
            <bitfield name="LINID" caption="LIN Identifier Sent or LIN Identifier Received Interrupt Disable" mask="0x4000"/>
            <bitfield name="LINTC" caption="LIN Transfer Conpleted Interrupt Disable" mask="0x8000"/>
            <bitfield name="RIIC" caption="Ring Indicator Input Change Disable" mask="0x10000" values="USART_IDR__RIIC"/>
            <bitfield name="DSRIC" caption="Data Set Ready Input Change Disable" mask="0x20000" values="USART_IDR__DSRIC"/>
            <bitfield name="DCDIC" caption="Data Carrier Detect Input Change Interrupt Disable" mask="0x40000" values="USART_IDR__DCDIC"/>
            <bitfield name="CTSIC" caption="Clear to Send Input Change Interrupt Disable" mask="0x80000" values="USART_IDR__CTSIC"/>
            <bitfield name="LINBE" caption="LIN Bus Error Interrupt Disable" mask="0x2000000"/>
            <bitfield name="LINISFE" caption="LIN Inconsistent Synch Field Error Interrupt Disable" mask="0x4000000"/>
            <bitfield name="LINIPE" caption="LIN Identifier Parity Interrupt Disable" mask="0x8000000"/>
            <bitfield name="LINCE" caption="LIN Checksum Error Interrupt Disable" mask="0x10000000"/>
            <bitfield name="LINSNRE" caption="LIN Slave Not Responding Error Interrupt Disable" mask="0x20000000"/>
            <bitfield name="LINSTE" caption="LIN Synch Tolerance Error Interrupt Disable" mask="0x40000000" values="USART_IDR__LINSTE"/>
            <bitfield name="LINHTE" caption="LIN Header Timeout Error Interrupt Disable" mask="0x80000000" values="USART_IDR__LINHTE"/>
          </mode>
          <mode name="SPI_SLAVE_MODE">
            <bitfield name="RXRDY" caption="Receiver Ready Interrupt Disable" mask="0x1" values="USART_IDR__RXRDY"/>
            <bitfield name="TXRDY" caption="Transmitter Ready Interrupt Disable" mask="0x2" values="USART_IDR__TXRDY"/>
            <bitfield name="RXBRK" caption="Receiver Break Interrupt Disable" mask="0x4" values="USART_IDR__RXBRK"/>
            <bitfield name="OVRE" caption="Overrun Error Interrupt Disable" mask="0x20" values="USART_IDR__OVRE"/>
            <bitfield name="FRAME" caption="Framing Error Interrupt Disable" mask="0x40" values="USART_IDR__FRAME"/>
            <bitfield name="PARE" caption="Parity Error Interrupt Disable" mask="0x80" values="USART_IDR__PARE"/>
            <bitfield name="TIMEOUT" caption="Time-out Interrupt Disable" mask="0x100" values="USART_IDR__TIMEOUT"/>
            <bitfield name="TXEMPTY" caption="Transmitter Empty Interrupt Disable" mask="0x200" values="USART_IDR__TXEMPTY"/>
            <bitfield name="UNRE" caption="SPI Underrun Error Interrupt Disable" mask="0x400" values="USART_IDR__UNRE"/>
            <bitfield name="TXBUFE" caption="Buffer Empty Interrupt Disable" mask="0x800" values="USART_IDR__TXBUFE"/>
            <bitfield name="RXBUFF" caption="Buffer Full Interrupt Disable" mask="0x1000" values="USART_IDR__RXBUFF"/>
            <bitfield name="NACK" caption="Non Acknowledge Interrupt Disable" mask="0x2000" values="USART_IDR__NACK"/>
            <bitfield name="RIIC" caption="Ring Indicator Input Change Disable" mask="0x10000" values="USART_IDR__RIIC"/>
            <bitfield name="DSRIC" caption="Data Set Ready Input Change Disable" mask="0x20000" values="USART_IDR__DSRIC"/>
            <bitfield name="DCDIC" caption="Data Carrier Detect Input Change Interrupt Disable" mask="0x40000" values="USART_IDR__DCDIC"/>
            <bitfield name="CTSIC" caption="Clear to Send Input Change Interrupt Disable" mask="0x80000" values="USART_IDR__CTSIC"/>
          </mode>
          <mode name="USART_MODE">
            <bitfield name="RXRDY" caption="Receiver Ready Interrupt Disable" mask="0x1" values="USART_IDR__RXRDY"/>
            <bitfield name="TXRDY" caption="Transmitter Ready Interrupt Disable" mask="0x2" values="USART_IDR__TXRDY"/>
            <bitfield name="RXBRK" caption="Receiver Break Interrupt Disable" mask="0x4" values="USART_IDR__RXBRK"/>
            <bitfield name="OVRE" caption="Overrun Error Interrupt Disable" mask="0x20" values="USART_IDR__OVRE"/>
            <bitfield name="FRAME" caption="Framing Error Interrupt Disable" mask="0x40" values="USART_IDR__FRAME"/>
            <bitfield name="PARE" caption="Parity Error Interrupt Disable" mask="0x80" values="USART_IDR__PARE"/>
            <bitfield name="TIMEOUT" caption="Time-out Interrupt Disable" mask="0x100" values="USART_IDR__TIMEOUT"/>
            <bitfield name="TXEMPTY" caption="Transmitter Empty Interrupt Disable" mask="0x200" values="USART_IDR__TXEMPTY"/>
            <bitfield name="ITER" caption="Iteration Interrupt Disable" mask="0x400" values="USART_IDR__ITER"/>
            <bitfield name="TXBUFE" caption="Buffer Empty Interrupt Disable" mask="0x800" values="USART_IDR__TXBUFE"/>
            <bitfield name="RXBUFF" caption="Buffer Full Interrupt Disable" mask="0x1000" values="USART_IDR__RXBUFF"/>
            <bitfield name="NACK" caption="Non Acknowledge Interrupt Disable" mask="0x2000" values="USART_IDR__NACK"/>
            <bitfield name="RIIC" caption="Ring Indicator Input Change Disable" mask="0x10000" values="USART_IDR__RIIC"/>
            <bitfield name="DSRIC" caption="Data Set Ready Input Change Disable" mask="0x20000" values="USART_IDR__DSRIC"/>
            <bitfield name="DCDIC" caption="Data Carrier Detect Input Change Interrupt Disable" mask="0x40000" values="USART_IDR__DCDIC"/>
            <bitfield name="CTSIC" caption="Clear to Send Input Change Interrupt Disable" mask="0x80000" values="USART_IDR__CTSIC"/>
            <bitfield name="MANE" caption="Manchester Error Interrupt Disable" mask="0x100000"/>
            <bitfield name="MANEA" caption="Manchester Error Interrupt Disable" mask="0x1000000" values="USART_IDR__MANEA"/>
          </mode>
        </register>
        <register name="IMR" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <mode name="LIN_MODE">
            <bitfield name="RXRDY" caption="RXRDY Interrupt Mask" mask="0x1" values="USART_IMR__RXRDY"/>
            <bitfield name="TXRDY" caption="TXRDY Interrupt Mask" mask="0x2" values="USART_IMR__TXRDY"/>
            <bitfield name="RXBRK" caption="Receiver Break Interrupt Mask" mask="0x4" values="USART_IMR__RXBRK"/>
            <bitfield name="OVRE" caption="Overrun Error Interrupt Mask" mask="0x20" values="USART_IMR__OVRE"/>
            <bitfield name="FRAME" caption="Framing Error Interrupt Mask" mask="0x40" values="USART_IMR__FRAME"/>
            <bitfield name="PARE" caption="Parity Error Interrupt Mask" mask="0x80" values="USART_IMR__PARE"/>
            <bitfield name="TIMEOUT" caption="Time-out Interrupt Mask" mask="0x100" values="USART_IMR__TIMEOUT"/>
            <bitfield name="TXEMPTY" caption="TXEMPTY Interrupt Mask" mask="0x200" values="USART_IMR__TXEMPTY"/>
            <bitfield name="ITER" caption="Iteration Interrupt Mask" mask="0x400" values="USART_IMR__ITER"/>
            <bitfield name="TXBUFE" caption="Buffer Empty Interrupt Mask" mask="0x800" values="USART_IMR__TXBUFE"/>
            <bitfield name="RXBUFF" caption="Buffer Full Interrupt Mask" mask="0x1000" values="USART_IMR__RXBUFF"/>
            <bitfield name="NACK" caption="Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Mask" mask="0x2000" values="USART_IMR__NACK"/>
            <bitfield name="LINID" caption="LIN Identifier Sent or LIN Received Interrupt Mask" mask="0x4000"/>
            <bitfield name="LINTC" caption="LIN Transfer Conpleted Interrupt Mask" mask="0x8000"/>
            <bitfield name="RIIC" caption="Ring Indicator Input Change Mask" mask="0x10000" values="USART_IMR__RIIC"/>
            <bitfield name="DSRIC" caption="Data Set Ready Input Change Mask" mask="0x20000" values="USART_IMR__DSRIC"/>
            <bitfield name="DCDIC" caption="Data Carrier Detect Input Change Interrupt Mask" mask="0x40000" values="USART_IMR__DCDIC"/>
            <bitfield name="CTSIC" caption="Clear to Send Input Change Interrupt Mask" mask="0x80000" values="USART_IMR__CTSIC"/>
            <bitfield name="LINBE" caption="LIN Bus Error Interrupt Mask" mask="0x2000000"/>
            <bitfield name="LINISFE" caption="LIN Inconsistent Synch Field Error Interrupt Mask" mask="0x4000000"/>
            <bitfield name="LINIPE" caption="LIN Identifier Parity Interrupt Mask" mask="0x8000000"/>
            <bitfield name="LINCE" caption="LIN Checksum Error Interrupt Mask" mask="0x10000000"/>
            <bitfield name="LINSNRE" caption="LIN Slave Not Responding Error Interrupt Mask" mask="0x20000000"/>
            <bitfield name="LINSTE" caption="LIN Synch Tolerance Error Interrupt Mask" mask="0x40000000" values="USART_IMR__LINSTE"/>
            <bitfield name="LINHTE" caption="LIN Header Timeout Error Interrupt Mask" mask="0x80000000" values="USART_IMR__LINHTE"/>
          </mode>
          <mode name="SPI_SLAVE_MODE">
            <bitfield name="RXRDY" caption="RXRDY Interrupt Mask" mask="0x1" values="USART_IMR__RXRDY"/>
            <bitfield name="TXRDY" caption="TXRDY Interrupt Mask" mask="0x2" values="USART_IMR__TXRDY"/>
            <bitfield name="RXBRK" caption="Receiver Break Interrupt Mask" mask="0x4" values="USART_IMR__RXBRK"/>
            <bitfield name="OVRE" caption="Overrun Error Interrupt Mask" mask="0x20" values="USART_IMR__OVRE"/>
            <bitfield name="FRAME" caption="Framing Error Interrupt Mask" mask="0x40" values="USART_IMR__FRAME"/>
            <bitfield name="PARE" caption="Parity Error Interrupt Mask" mask="0x80" values="USART_IMR__PARE"/>
            <bitfield name="TIMEOUT" caption="Time-out Interrupt Mask" mask="0x100" values="USART_IMR__TIMEOUT"/>
            <bitfield name="TXEMPTY" caption="TXEMPTY Interrupt Mask" mask="0x200" values="USART_IMR__TXEMPTY"/>
            <bitfield name="UNRE" caption="SPI Underrun Error Interrupt Mask" mask="0x400" values="USART_IMR__UNRE"/>
            <bitfield name="TXBUFE" caption="Buffer Empty Interrupt Mask" mask="0x800" values="USART_IMR__TXBUFE"/>
            <bitfield name="RXBUFF" caption="Buffer Full Interrupt Mask" mask="0x1000" values="USART_IMR__RXBUFF"/>
            <bitfield name="NACK" caption="Non Acknowledge Interrupt Mask" mask="0x2000" values="USART_IMR__NACK"/>
            <bitfield name="RIIC" caption="Ring Indicator Input Change Mask" mask="0x10000" values="USART_IMR__RIIC"/>
            <bitfield name="DSRIC" caption="Data Set Ready Input Change Mask" mask="0x20000" values="USART_IMR__DSRIC"/>
            <bitfield name="DCDIC" caption="Data Carrier Detect Input Change Interrupt Mask" mask="0x40000" values="USART_IMR__DCDIC"/>
            <bitfield name="CTSIC" caption="Clear to Send Input Change Interrupt Mask" mask="0x80000" values="USART_IMR__CTSIC"/>
          </mode>
          <mode name="USART_MODE">
            <bitfield name="RXRDY" caption="RXRDY Interrupt Mask" mask="0x1" values="USART_IMR__RXRDY"/>
            <bitfield name="TXRDY" caption="TXRDY Interrupt Mask" mask="0x2" values="USART_IMR__TXRDY"/>
            <bitfield name="RXBRK" caption="Receiver Break Interrupt Mask" mask="0x4" values="USART_IMR__RXBRK"/>
            <bitfield name="OVRE" caption="Overrun Error Interrupt Mask" mask="0x20" values="USART_IMR__OVRE"/>
            <bitfield name="FRAME" caption="Framing Error Interrupt Mask" mask="0x40" values="USART_IMR__FRAME"/>
            <bitfield name="PARE" caption="Parity Error Interrupt Mask" mask="0x80" values="USART_IMR__PARE"/>
            <bitfield name="TIMEOUT" caption="Time-out Interrupt Mask" mask="0x100" values="USART_IMR__TIMEOUT"/>
            <bitfield name="TXEMPTY" caption="TXEMPTY Interrupt Mask" mask="0x200" values="USART_IMR__TXEMPTY"/>
            <bitfield name="ITER" caption="Iteration Interrupt Mask" mask="0x400" values="USART_IMR__ITER"/>
            <bitfield name="TXBUFE" caption="Buffer Empty Interrupt Mask" mask="0x800" values="USART_IMR__TXBUFE"/>
            <bitfield name="RXBUFF" caption="Buffer Full Interrupt Mask" mask="0x1000" values="USART_IMR__RXBUFF"/>
            <bitfield name="NACK" caption="Non Acknowledge Interrupt Mask" mask="0x2000" values="USART_IMR__NACK"/>
            <bitfield name="RIIC" caption="Ring Indicator Input Change Mask" mask="0x10000" values="USART_IMR__RIIC"/>
            <bitfield name="DSRIC" caption="Data Set Ready Input Change Mask" mask="0x20000" values="USART_IMR__DSRIC"/>
            <bitfield name="DCDIC" caption="Data Carrier Detect Input Change Interrupt Mask" mask="0x40000" values="USART_IMR__DCDIC"/>
            <bitfield name="CTSIC" caption="Clear to Send Input Change Interrupt Mask" mask="0x80000" values="USART_IMR__CTSIC"/>
            <bitfield name="MANE" caption="Manchester Error Interrupt Mask" mask="0x100000"/>
            <bitfield name="MANEA" caption="Manchester Error Interrupt Mask" mask="0x1000000" values="USART_IMR__MANEA"/>
          </mode>
        </register>
        <register name="CSR" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Channel Status Register">
          <mode name="LIN_MODE">
            <bitfield name="RXRDY" caption="Receiver Ready" mask="0x1" values="USART_CSR__RXRDY"/>
            <bitfield name="TXRDY" caption="Transmitter Ready" mask="0x2" values="USART_CSR__TXRDY"/>
            <bitfield name="RXBRK" caption="Break Received/End of Break" mask="0x4" values="USART_CSR__RXBRK"/>
            <bitfield name="OVRE" caption="Overrun Error" mask="0x20" values="USART_CSR__OVRE"/>
            <bitfield name="FRAME" caption="Framing Error" mask="0x40" values="USART_CSR__FRAME"/>
            <bitfield name="PARE" caption="Parity Error" mask="0x80" values="USART_CSR__PARE"/>
            <bitfield name="TIMEOUT" caption="Receiver Time-out" mask="0x100" values="USART_CSR__TIMEOUT"/>
            <bitfield name="TXEMPTY" caption="Transmitter Empty" mask="0x200" values="USART_CSR__TXEMPTY"/>
            <bitfield name="ITER" caption="Max number of Repetitions Reached" mask="0x400" values="USART_CSR__ITER"/>
            <bitfield name="TXBUFE" caption="Transmission Buffer Empty" mask="0x800" values="USART_CSR__TXBUFE"/>
            <bitfield name="RXBUFF" caption="Reception Buffer Full" mask="0x1000" values="USART_CSR__RXBUFF"/>
            <bitfield name="NACK" caption="Non Acknowledge or LIN Break Sent or LIN Break Received" mask="0x2000" values="USART_CSR__NACK"/>
            <bitfield name="LINID" caption="LIN Identifier Sent or LIN Identifier Received" mask="0x4000"/>
            <bitfield name="LINTC" caption="LIN Transfer Conpleted" mask="0x8000"/>
            <bitfield name="RIIC" caption="Ring Indicator Input Change Flag" mask="0x10000" values="USART_CSR__RIIC"/>
            <bitfield name="DSRIC" caption="Data Set Ready Input Change Flag" mask="0x20000" values="USART_CSR__DSRIC"/>
            <bitfield name="DCDIC" caption="Data Carrier Detect Input Change Flag" mask="0x40000" values="USART_CSR__DCDIC"/>
            <bitfield name="CTSIC" caption="Clear to Send Input Change Flag" mask="0x80000" values="USART_CSR__CTSIC"/>
            <bitfield name="RI" caption="Image of RI Input" mask="0x100000" values="USART_CSR__RI"/>
            <bitfield name="DSR" caption="Image of DSR Input" mask="0x200000" values="USART_CSR__DSR"/>
            <bitfield name="DCD" caption="Image of DCD Input" mask="0x400000" values="USART_CSR__DCD"/>
            <bitfield name="LINBLS" caption="LIN Bus Line Status" mask="0x800000" values="USART_CSR__LINBLS"/>
            <bitfield name="LINBE" caption="LIN Bit Error" mask="0x2000000"/>
            <bitfield name="LINISFE" caption="LIN Inconsistent Synch Field Error" mask="0x4000000"/>
            <bitfield name="LINIPE" caption="LIN Identifier Parity Error" mask="0x8000000"/>
            <bitfield name="LINCE" caption="LIN Checksum Error" mask="0x10000000"/>
            <bitfield name="LINSNRE" caption="LIN Slave Not Responding Error" mask="0x20000000"/>
            <bitfield name="LINSTE" caption="LIN Synch Tolerance Error" mask="0x40000000" values="USART_CSR__LINSTE"/>
            <bitfield name="LINHTE" caption="LIN Header Timeout Error" mask="0x80000000" values="USART_CSR__LINHTE"/>
          </mode>
          <mode name="SPI_SLAVE_MODE">
            <bitfield name="RXRDY" caption="Receiver Ready" mask="0x1" values="USART_CSR__RXRDY"/>
            <bitfield name="TXRDY" caption="Transmitter Ready" mask="0x2" values="USART_CSR__TXRDY"/>
            <bitfield name="RXBRK" caption="Break Received/End of Break" mask="0x4" values="USART_CSR__RXBRK"/>
            <bitfield name="OVRE" caption="Overrun Error" mask="0x20" values="USART_CSR__OVRE"/>
            <bitfield name="FRAME" caption="Framing Error" mask="0x40" values="USART_CSR__FRAME"/>
            <bitfield name="PARE" caption="Parity Error" mask="0x80" values="USART_CSR__PARE"/>
            <bitfield name="TIMEOUT" caption="Receiver Time-out" mask="0x100" values="USART_CSR__TIMEOUT"/>
            <bitfield name="TXEMPTY" caption="Transmitter Empty" mask="0x200" values="USART_CSR__TXEMPTY"/>
            <bitfield name="UNRE" caption="SPI Underrun Error" mask="0x400" values="USART_CSR__UNRE"/>
            <bitfield name="TXBUFE" caption="Transmission Buffer Empty" mask="0x800" values="USART_CSR__TXBUFE"/>
            <bitfield name="RXBUFF" caption="Reception Buffer Full" mask="0x1000" values="USART_CSR__RXBUFF"/>
            <bitfield name="NACK" caption="Non Acknowledge" mask="0x2000" values="USART_CSR__NACK"/>
            <bitfield name="RIIC" caption="Ring Indicator Input Change Flag" mask="0x10000" values="USART_CSR__RIIC"/>
            <bitfield name="DSRIC" caption="Data Set Ready Input Change Flag" mask="0x20000" values="USART_CSR__DSRIC"/>
            <bitfield name="DCDIC" caption="Data Carrier Detect Input Change Flag" mask="0x40000" values="USART_CSR__DCDIC"/>
            <bitfield name="CTSIC" caption="Clear to Send Input Change Flag" mask="0x80000" values="USART_CSR__CTSIC"/>
            <bitfield name="RI" caption="Image of RI Input" mask="0x100000" values="USART_CSR__RI"/>
            <bitfield name="DSR" caption="Image of DSR Input" mask="0x200000" values="USART_CSR__DSR"/>
            <bitfield name="DCD" caption="Image of DCD Input" mask="0x400000" values="USART_CSR__DCD"/>
            <bitfield name="CTS" caption="Image of CTS Input" mask="0x800000" values="USART_CSR__CTS"/>
          </mode>
          <mode name="USART_MODE">
            <bitfield name="RXRDY" caption="Receiver Ready" mask="0x1" values="USART_CSR__RXRDY"/>
            <bitfield name="TXRDY" caption="Transmitter Ready" mask="0x2" values="USART_CSR__TXRDY"/>
            <bitfield name="RXBRK" caption="Break Received/End of Break" mask="0x4" values="USART_CSR__RXBRK"/>
            <bitfield name="OVRE" caption="Overrun Error" mask="0x20" values="USART_CSR__OVRE"/>
            <bitfield name="FRAME" caption="Framing Error" mask="0x40" values="USART_CSR__FRAME"/>
            <bitfield name="PARE" caption="Parity Error" mask="0x80" values="USART_CSR__PARE"/>
            <bitfield name="TIMEOUT" caption="Receiver Time-out" mask="0x100" values="USART_CSR__TIMEOUT"/>
            <bitfield name="TXEMPTY" caption="Transmitter Empty" mask="0x200" values="USART_CSR__TXEMPTY"/>
            <bitfield name="ITER" caption="Max number of Repetitions Reached" mask="0x400" values="USART_CSR__ITER"/>
            <bitfield name="TXBUFE" caption="Transmission Buffer Empty" mask="0x800" values="USART_CSR__TXBUFE"/>
            <bitfield name="RXBUFF" caption="Reception Buffer Full" mask="0x1000" values="USART_CSR__RXBUFF"/>
            <bitfield name="NACK" caption="Non Acknowledge" mask="0x2000" values="USART_CSR__NACK"/>
            <bitfield name="RIIC" caption="Ring Indicator Input Change Flag" mask="0x10000" values="USART_CSR__RIIC"/>
            <bitfield name="DSRIC" caption="Data Set Ready Input Change Flag" mask="0x20000" values="USART_CSR__DSRIC"/>
            <bitfield name="DCDIC" caption="Data Carrier Detect Input Change Flag" mask="0x40000" values="USART_CSR__DCDIC"/>
            <bitfield name="CTSIC" caption="Clear to Send Input Change Flag" mask="0x80000" values="USART_CSR__CTSIC"/>
            <bitfield name="RI" caption="Image of RI Input" mask="0x100000" values="USART_CSR__RI"/>
            <bitfield name="DSR" caption="Image of DSR Input" mask="0x200000" values="USART_CSR__DSR"/>
            <bitfield name="DCD" caption="Image of DCD Input" mask="0x400000" values="USART_CSR__DCD"/>
            <bitfield name="CTS" caption="Image of CTS Input" mask="0x800000" values="USART_CSR__CTS"/>
            <bitfield name="MANERR" caption="Manchester Error" mask="0x1000000" values="USART_CSR__MANERR"/>
          </mode>
        </register>
        <register name="RHR" offset="0x18" rw="R" size="4" initval="0x00000000" caption="Receiver Holding Register">
          <bitfield name="RXCHR" caption="Received Character" mask="0x1FF"/>
          <bitfield name="RXSYNH" caption="Received Sync" mask="0x8000" values="USART_RHR__RXSYNH"/>
        </register>
        <register name="THR" offset="0x1c" rw="W" size="4" initval="0x00000000" caption="Transmitter Holding Register">
          <bitfield name="TXCHR" caption="Character to be Transmitted" mask="0x1FF"/>
          <bitfield name="TXSYNH" caption="Sync Field to be transmitted" mask="0x8000" values="USART_THR__TXSYNH"/>
        </register>
        <register name="BRGR" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Baud Rate Generator Register">
          <bitfield name="CD" caption="Clock Divisor" mask="0xFFFF" values="USART_BRGR__CD"/>
          <bitfield name="FP" caption="Fractional Part" mask="0x70000" values="USART_BRGR__FP"/>
        </register>
        <register name="RTOR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Receiver Time-out Register">
          <bitfield name="TO" caption="Time-out Value" mask="0x1FFFF" values="USART_RTOR__TO"/>
        </register>
        <register name="TTGR" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="Transmitter Timeguard Register">
          <bitfield name="TG" caption="Timeguard Value" mask="0xFF" values="USART_TTGR__TG"/>
        </register>
