Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS8B.xml
        <register name="UPCON4" offset="0x5d0" rw="R" size="4" initval="0x00000000" caption="Pipe Control Register">
          <bitfield name="RXINE" caption="RXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="TXOUTE" caption="TXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="TXSTPE" caption="TXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="PERRE" caption="PERR Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKEDE" caption="NAKED Interrupt Enable" mask="0x10"/>
          <bitfield name="ERRORFIE" caption="ERRORFI Interrupt Enable" mask="0x20"/>
          <bitfield name="RXSTALLDE" caption="RXTALLD Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x400"/>
          <bitfield name="NBUSYBKE" caption="NBUSYBKInterrupt Enable" mask="0x1000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="PFREEZE" caption="Pipe Freeze" mask="0x20000"/>
          <bitfield name="INITDTGL" caption="Data Toggle Initialization" mask="0x40000"/>
          <bitfield name="INITBK" caption="Bank Initialization" mask="0x80000"/>
        </register>
        <register name="UPCON5" offset="0x5d4" rw="R" size="4" initval="0x00000000" caption="Pipe Control Register">
          <bitfield name="RXINE" caption="RXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="TXOUTE" caption="TXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="TXSTPE" caption="TXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="PERRE" caption="PERR Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKEDE" caption="NAKED Interrupt Enable" mask="0x10"/>
          <bitfield name="ERRORFIE" caption="ERRORFI Interrupt Enable" mask="0x20"/>
          <bitfield name="RXSTALLDE" caption="RXTALLD Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x400"/>
          <bitfield name="NBUSYBKE" caption="NBUSYBKInterrupt Enable" mask="0x1000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="PFREEZE" caption="Pipe Freeze" mask="0x20000"/>
          <bitfield name="INITDTGL" caption="Data Toggle Initialization" mask="0x40000"/>
          <bitfield name="INITBK" caption="Bank Initialization" mask="0x80000"/>
        </register>
        <register name="UPCON6" offset="0x5d8" rw="R" size="4" initval="0x00000000" caption="Pipe Control Register">
          <bitfield name="RXINE" caption="RXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="TXOUTE" caption="TXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="TXSTPE" caption="TXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="PERRE" caption="PERR Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKEDE" caption="NAKED Interrupt Enable" mask="0x10"/>
          <bitfield name="ERRORFIE" caption="ERRORFI Interrupt Enable" mask="0x20"/>
          <bitfield name="RXSTALLDE" caption="RXTALLD Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x400"/>
          <bitfield name="NBUSYBKE" caption="NBUSYBKInterrupt Enable" mask="0x1000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="PFREEZE" caption="Pipe Freeze" mask="0x20000"/>
          <bitfield name="INITDTGL" caption="Data Toggle Initialization" mask="0x40000"/>
          <bitfield name="INITBK" caption="Bank Initialization" mask="0x80000"/>
        </register>
        <register name="UPCON7" offset="0x5dc" rw="R" size="4" initval="0x00000000" caption="Pipe Control Register">
          <bitfield name="RXINE" caption="RXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="TXOUTE" caption="TXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="TXSTPE" caption="TXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="PERRE" caption="PERR Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKEDE" caption="NAKED Interrupt Enable" mask="0x10"/>
          <bitfield name="ERRORFIE" caption="ERRORFI Interrupt Enable" mask="0x20"/>
          <bitfield name="RXSTALLDE" caption="RXTALLD Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x400"/>
          <bitfield name="NBUSYBKE" caption="NBUSYBKInterrupt Enable" mask="0x1000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="PFREEZE" caption="Pipe Freeze" mask="0x20000"/>
          <bitfield name="INITDTGL" caption="Data Toggle Initialization" mask="0x40000"/>
          <bitfield name="INITBK" caption="Bank Initialization" mask="0x80000"/>
        </register>
        <register name="UPCON0SET" offset="0x5f0" rw="W" size="4" initval="0x00000000" caption="Pipe Control Set Register">
          <bitfield name="RXINES" caption="RXINE Set" mask="0x1"/>
          <bitfield name="TXOUTES" caption="TXOUTE Set" mask="0x2"/>
          <bitfield name="TXSTPES" caption="TXSTPE Set" mask="0x4"/>
          <bitfield name="PERRES" caption="PERRE Set" mask="0x8"/>
          <bitfield name="NAKEDES" caption="NAKEDE Set" mask="0x10"/>
          <bitfield name="ERRORFIES" caption="ERRORFIE Set" mask="0x20"/>
          <bitfield name="RXSTALLDES" caption="RXSTALLDE Set" mask="0x40"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x400"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="FIFOCONS" caption="FIFOCON Set" mask="0x4000"/>
          <bitfield name="PFREEZES" caption="PFREEZE Set" mask="0x20000"/>
          <bitfield name="INITDTGLS" caption="INITDTGL Set" mask="0x40000"/>
          <bitfield name="INITBKS" caption="INITBK Set" mask="0x80000"/>
        </register>
        <register name="UPCON1SET" offset="0x5f4" rw="W" size="4" initval="0x00000000" caption="Pipe Control Set Register">
          <bitfield name="RXINES" caption="RXINE Set" mask="0x1"/>
          <bitfield name="TXOUTES" caption="TXOUTE Set" mask="0x2"/>
          <bitfield name="TXSTPES" caption="TXSTPE Set" mask="0x4"/>
          <bitfield name="PERRES" caption="PERRE Set" mask="0x8"/>
          <bitfield name="NAKEDES" caption="NAKEDE Set" mask="0x10"/>
          <bitfield name="ERRORFIES" caption="ERRORFIE Set" mask="0x20"/>
          <bitfield name="RXSTALLDES" caption="RXSTALLDE Set" mask="0x40"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x400"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="FIFOCONS" caption="FIFOCON Set" mask="0x4000"/>
          <bitfield name="PFREEZES" caption="PFREEZE Set" mask="0x20000"/>
          <bitfield name="INITDTGLS" caption="INITDTGL Set" mask="0x40000"/>
          <bitfield name="INITBKS" caption="INITBK Set" mask="0x80000"/>
        </register>
        <register name="UPCON2SET" offset="0x5f8" rw="W" size="4" initval="0x00000000" caption="Pipe Control Set Register">
          <bitfield name="RXINES" caption="RXINE Set" mask="0x1"/>
          <bitfield name="TXOUTES" caption="TXOUTE Set" mask="0x2"/>
          <bitfield name="TXSTPES" caption="TXSTPE Set" mask="0x4"/>
          <bitfield name="PERRES" caption="PERRE Set" mask="0x8"/>
          <bitfield name="NAKEDES" caption="NAKEDE Set" mask="0x10"/>
          <bitfield name="ERRORFIES" caption="ERRORFIE Set" mask="0x20"/>
          <bitfield name="RXSTALLDES" caption="RXSTALLDE Set" mask="0x40"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x400"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="FIFOCONS" caption="FIFOCON Set" mask="0x4000"/>
          <bitfield name="PFREEZES" caption="PFREEZE Set" mask="0x20000"/>
          <bitfield name="INITDTGLS" caption="INITDTGL Set" mask="0x40000"/>
          <bitfield name="INITBKS" caption="INITBK Set" mask="0x80000"/>
        </register>
